mcci-catena/bootloader/platform/soc/stm32l0/i/mcci_stm32l0xx.h
#define	MCCI_STM32L0_OPTIONS_U_ID_0	UINT32_C(0x1FF80050)			///< register address: unique ID bits 31:0
#define	MCCI_STM32L0_OPTIONS_U_ID_4	(MCCI_STM32L0_OPTIONS_U_ID_0 + 0x04)	///< register address: unique ID bits 63:32
#define	MCCI_STM32L0_OPTIONS_U_ID_8	(MCCI_STM32L0_OPTIONS_U_ID_0 + 0x014)	///< register address: unique ID bits 95:64
///	@}

/****************************************************************************\
|
|	Flash Control Registers (3.7)
|
\****************************************************************************/

/// \name FLASH registers
///	@{
#define MCCI_STM32L0_REG_FLASH_ACR	(MCCI_STM32L0_REG_FLASH + 0x00)	///< Flash access control register
#define MCCI_STM32L0_REG_FLASH_PECR	(MCCI_STM32L0_REG_FLASH + 0x04)	///< Flash program and erase control register
#define MCCI_STM32L0_REG_FLASH_PDKEYR	(MCCI_STM32L0_REG_FLASH + 0x08)	///< Flash power-down key register
#define MCCI_STM32L0_REG_FLASH_PEKEYR	(MCCI_STM32L0_REG_FLASH + 0x0C)	///< Flash PECR unlock key register
#define MCCI_STM32L0_REG_FLASH_PRGKEYR	(MCCI_STM32L0_REG_FLASH + 0x10)	///< Flash program/erase key register
#define MCCI_STM32L0_REG_FLASH_OPTKEYR	(MCCI_STM32L0_REG_FLASH + 0x14)	///< Flash option bytes unlock key register
#define MCCI_STM32L0_REG_FLASH_SR	(MCCI_STM32L0_REG_FLASH + 0x18)	///< Flash status register
#define MCCI_STM32L0_REG_FLASH_OPTR	(MCCI_STM32L0_REG_FLASH + 0x1C)	///< Flash option bytes register
#define MCCI_STM32L0_REG_FLASH_WPROT1	(MCCI_STM32L0_REG_FLASH + 0x20)	///< Flash write proection register 1
#define MCCI_STM32L0_REG_FLASH_WPROT2	(MCCI_STM32L0_REG_FLASH + 0x80)	///< Flash write protection register 2
///	@}

/// \name FLASH_ACR bits
///	@{
#define MCCI_STM32L0_REG_FLASH_ACR_RSV7		UINT32_C(0xFFFFFF80)	///< Reserved, don't change
#define MCCI_STM32L0_REG_FLASH_ACR_PRE_READ	(UINT32_C(1) << 6)	///< Enable pre-read
#define MCCI_STM32L0_REG_FLASH_ACR_DISAB_BUF	(UINT32_C(1) << 5)	///< Disable read buffer
#define MCCI_STM32L0_REG_FLASH_ACR_RUN_PD	(UINT32_C(1) << 4)	///< power-down in run mode
#define MCCI_STM32L0_REG_FLASH_ACR_SLEEP_PD	(UINT32_C(1) << 3)	///< power-down in sleep mode
#define MCCI_STM32L0_REG_FLASH_ACR_RSV2		(UINT32_C(1) << 2)	///< Reserved, don't change
#define MCCI_STM32L0_REG_FLASH_ACR_PRFTEN	(UINT32_C(1) << 1)	///< prefetch enable
#define MCCI_STM32L0_REG_FLASH_ACR_LATENCY	(UINT32_C(1) << 0)	///< NVM latency: 1 wait state (not zero wait state)
///	@}

/// \name FLASH_PECR bits
///	@{
#define MCCI_STM32L0_REG_FLASH_PECR_RSV24		UINT32_C(0xFF000000)	///< Reserved, don't change
#define MCCI_STM32L0_REG_FLASH_PECR_NZDISABLE		(UINT32_C(1) << 23)	///< Disable non-zero check
#define MCCI_STM32L0_REG_FLASH_PECR_RSV19		(UINT32_C(0xF) << 19)	///< Reserved, don't change
#define MCCI_STM32L0_REG_FLASH_PECR_OBL_LAUNCH		(UINT32_C(1) << 18)	///< Reload option bytes and reset system
#define MCCI_STM32L0_REG_FLASH_PECR_ERRIE		(UINT32_C(1) << 17)	///< Error interrupt enable
#define MCCI_STM32L0_REG_FLASH_PECR_EOPIE		(UINT32_C(1) << 16)	///< End of programming interrupt enable
#define MCCI_STM32L0_REG_FLASH_PECR_PARALLELBANK	(UINT32_C(1) << 15)	///< Parallel bank programming enable
#define MCCI_STM32L0_REG_FLASH_PECR_RSV11		(UINT32_C(0xF) << 11)	///< Reserved, don't change
#define MCCI_STM32L0_REG_FLASH_PECR_FPRG		(UINT32_C(1) << 10)	///< Enable half-page programming mode
#define MCCI_STM32L0_REG_FLASH_PECR_ERASE		(UINT32_C(1) << 9)	///< Erase operation requested/not requested
#define MCCI_STM32L0_REG_FLASH_PECR_FIX			(UINT32_C(1) << 8)	///< Atomatically erase before programming EEPROM and options
#define MCCI_STM32L0_REG_FLASH_PECR_RSV5		(UINT32_C(7) << 5)	///< Reserved, don't change
#define MCCI_STM32L0_REG_FLASH_PECR_DATA		(UINT32_C(1) << 4)	///< Select data memory
#define MCCI_STM32L0_REG_FLASH_PECR_PROG		(UINT32_C(1) << 3)	///< Select program memory
#define MCCI_STM32L0_REG_FLASH_PECR_OPTLOCK		(UINT32_C(1) << 2)	///< Lock option bytes
#define MCCI_STM32L0_REG_FLASH_PECR_PRGLOCK		(UINT32_C(1) << 1)	///< Lock program memory
#define MCCI_STM32L0_REG_FLASH_PECR_PELOCK		(UINT32_C(1) << 0)	///< Lock the FLASH_PECR register
///	@}

/// \name FLASH_PDKEYR bits
///	@{
#define MCCI_STM32L0_REG_FLASH_PDKEYR_UNLOCK1	UINT32_C(0x04152637)	///< unlock word 1 for RUN_PD
#define MCCI_STM32L0_REG_FLASH_PDKEYR_UNLOCK2	UINT32_C(0xFAFBFCFD)	///< unlock word 2 for RUN_PD
///	@}

/// \name FLASH_PEKEYR bits
///	@{
#define MCCI_STM32L0_REG_FLASH_PEKEYR_UNLOCK1	UINT32_C(0x89ABCDEF)	///< unlock word 1 for PECR
#define MCCI_STM32L0_REG_FLASH_PEKEYR_UNLOCK2	UINT32_C(0x02030405)	///< unlock word 2 for PECR
///	@}

/// \name FLASH_PRGKEYR bits
///	@{
#define MCCI_STM32L0_REG_FLASH_PRGKEYR_UNLOCK1	UINT32_C(0x8C9DAEBF)	///< unlock word 1 for PRGKEYR
#define MCCI_STM32L0_REG_FLASH_PRGKEYR_UNLOCK2	UINT32_C(0x13141516)	///< unlock word 2 for PRGKEYR
///	@}

/// \name FLASH_OPTKEYR bits
///	@{
#define MCCI_STM32L0_REG_FLASH_OPTKEYR_UNLOCK1	UINT32_C(0xFBEAD9C8)	///< unlock word 1 for option bytes
#define MCCI_STM32L0_REG_FLASH_OPTKEYR_UNLOCK2	UINT32_C(0x24252627)	///< unlock word 2 for option bytes
///	@}

/// \name FLASH_SR bits
///	@{
#define MCCI_STM32L0_REG_FLASH_SR_RSV18		UINT32_C(0xFFFC0000)	///< Reserved, don't change.
#define MCCI_STM32L0_REG_FLASH_SR_FWWERR	(UINT32_C(1) << 17)	///< Write/erase aborted for fetch.
#define MCCI_STM32L0_REG_FLASH_SR_NOTZEROERR	(UINT32_C(1) << 16)	///< Attempt to program non-zero area
#define MCCI_STM32L0_REG_FLASH_SR_RSV14		(UINT32_C(3) << 14)	///< Reserved, don't change.
#define MCCI_STM32L0_REG_FLASH_SR_RDERR		(UINT32_C(1) << 13)	///< Read-protection error
#define MCCI_STM32L0_REG_FLASH_SR_RSV12		(UINT32_C(1) << 12)	///< Reserved, don't change.
#define MCCI_STM32L0_REG_FLASH_SR_OPTVERR	(UINT32_C(1) << 11)	///< Option valid error
#define MCCI_STM32L0_REG_FLASH_SR_SIZERR	(UINT32_C(1) << 10)	///< Size error when programming
#define MCCI_STM32L0_REG_FLASH_SR_PGAERR	(UINT32_C(1) << 9)	///< Programming alignment error
#define MCCI_STM32L0_REG_FLASH_SR_WRPERR	(UINT32_C(1) << 8)	///< write protection error.
#define MCCI_STM32L0_REG_FLASH_SR_RSV4		(UINT32_C(0xF) << 4)	///< Reserved, don't change.
#define MCCI_STM32L0_REG_FLASH_SR_READY		(UINT32_C(1) << 3)	///< NVM is ready
#define MCCI_STM32L0_REG_FLASH_SR_ENDHV		(UINT32_C(1) << 2)	///< High voltage is off (not on), not active
#define MCCI_STM32L0_REG_FLASH_SR_EOP		(UINT32_C(1) << 1)	///< End of program
#define MCCI_STM32L0_REG_FLASH_SR_BSY		(UINT32_C(1) << 0)	///< Busy doing write/erase
///	@}

/// \name FLASH_OPTR bits
///	@{
#define MCCI_STM32L0_REG_FLASH_OPTR_nBOOT1	(UINT32_C(1) << 31)	///< If boot0, boot from system rom (not RAM)
#define MCCI_STM32L0_REG_FLASH_OPTR_RSV24	(UINT32_C(0x7F) << 24)	///< Reserved, don't change
#define MCCI_STM32L0_REG_FLASH_OPTR_BFB2	(UINT32_C(1) << 23)	///< Boot from system memory (not bank 2)
#define MCCI_STM32L0_REG_FLASH_OPTR_nRST_STDBY	(UINT32_C(1) << 22)	///< do not generate reset when entering standby
#define MCCI_STM32L0_REG_FLASH_OPTR_nRST_STOP	(UINT32_C(1) << 21)	///< do not generate reset when entering stop
#define MCCI_STM32L0_REG_FLASH_OPTR_WDG_SW	(UINT32_C(1) << 20)	///< software (not hardware) watchdog

#define MCCI_STM32L0_REG_FLASH_OPTR_BOR_LEV	(UINT32_C(0xF) << 16)	///< brown-out reset level
#define  MCCI_STM32L0_REG_FLASH_OPTR_BOR_LEV_1v8	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_FLASH_OPTR_BOR_LEV, 8)		///< Level 1 (1.8 V)
#define  MCCI_STM32L0_REG_FLASH_OPTR_BOR_LEV_2v0	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_FLASH_OPTR_BOR_LEV, 9)		///< Level 2 (2.0 V)
#define  MCCI_STM32L0_REG_FLASH_OPTR_BOR_LEV_2v5	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_FLASH_OPTR_BOR_LEV, 10)	///< Level 3 (2.5 V)
#define  MCCI_STM32L0_REG_FLASH_OPTR_BOR_LEV_2v7	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_FLASH_OPTR_BOR_LEV, 11)	///< Level 4 (2.7 V)
#define  MCCI_STM32L0_REG_FLASH_OPTR_BOR_LEV_3v0	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_FLASH_OPTR_BOR_LEV, 12)	///< Level 5 (3.0 V)

#define MCCI_STM32L0_REG_FLASH_OPTR_RSV9	(UINT32_C(0x7F) << 9)	///< Reserved, don't change
#define MCCI_STM32L0_REG_FLASH_OPTR_WPRMOD	(UINT32_C(1) << 8)	///< PCROP enabled (use WPROT for read protection)

#define MCCI_STM32L0_REG_FLASH_OPTR_RDPROT	(UINT32_C(0xFF) << 0)	///< Read protection level
#define  MCCI_STM32L0_REG_FLASH_OPTR_RDPROT_L0	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_FLASH_OPTR_RDPROT, 0xAA)	//< level 0
#define  MCCI_STM32L0_REG_FLASH_OPTR_RDPROT_L2	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_FLASH_OPTR_RDPROT, 0xCC)	//< level 2
#define  MCCI_STM32L0_REG_FLASH_OPTR_RDPROT_L1	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_FLASH_OPTR_RDPROT, 0x0)	//< level 2

/// \brief given image of FLASH_OPTR, return true if set for level 0 protection
#define	MCCI_STM32L0_FLASH_OPTR_RDPROT_IS_L0(v)	\
	((v) & MCCI_STM32L0_REG_FLASH_OPTR_RDPROT) == MCCI_STM32L0_REG_FLASH_OPTR_RDPROT_L0)
/// \brief given image of FLASH_OPTR, return true if set for level 2 protection
#define	MCCI_STM32L0_FLASH_OPTR_RDPROT_IS_L2(v)	\
	((v) & MCCI_STM32L0_REG_FLASH_OPTR_RDPROT) == MCCI_STM32L0_REG_FLASH_OPTR_RDPROT_L0)
/// \brief given image of FLASH_OPTR, return true if set for level 1 protection
#define	MCCI_STM32L0_FLASH_OPTR_RDPROT_IS_L1(v)	\
	(! (MCCI_STM32L0_FLASH_OPTR_RDPROT_IS_L0(v) || MCCI_STM32L0_FLASH_OPTR_RDPROT_IS_L2(v)))
///	@}

/// \name FLASH_WPROT1, FLASH_WPROT2 bits
///	@{
#define MCCI_STM32L0_FLASH_SECTOR_SIZE		UINT32_C(4096)	///< size in bytes of a flash sector
/// \brief given a flash address, convert to sector number
#define	MCCI_STM32L0_FLASH_ADDRESS_GET_SECTOR(a)	\
	(((uint32_t)(a) - MCCI_STM32L0_MEMORY_FLASH) >> MCCI_BOOTLOADER_FIELD_SHIFT(MCCI_STM32L0_FLASH_SECTOR_SIZE))

/// \brief get reg offset for protection bit for sector \p s
#define	MCCI_STM32L0_REG_FLASH_WPROTx_FOR_SECTOR(s)	((s) < 32 ? MCCI_STM32L0_REG_FLASH_WPROT1 : MCCI_STM32L0_REG_FLASH_WPROT2)

/// \brief get mask for sector \p s.
#define	MCCI_STM32L0_FLASH_WPROT_MASK_FOR_SECTOR(s)	(UINT32_C(1) << ((s) & 0x1F))
///	@}

/// \name Flash programming constants
///	@{
#define MCCI_STM32L0_FLASH_HALF_PAGE_SIZE	UINT32_C(64)	///< size in bytes of a half-page
#define MCCI_STM32L0_FLASH_PAGE_SIZE		UINT32_C(128)	///< size in bytes of a page
///	@}

/****************************************************************************\
|
|	Power Control Registers
|
\****************************************************************************/

/// \name PWR registers
///	@{
#define	MCCI_STM32L0_REG_PWR_CR		(MCCI_STM32L0_REG_PWR + 0x0)
#define	MCCI_STM32L0_REG_PWR_CSR	(MCCI_STM32L0_REG_PWR + 0x4)
///	@}

/// \name PWR_CR bits
///	@{
#define	MCCI_STM32L0_REG_PWR_CR_LPRUN		(UINT32_C(1) << 14)	///< Low power run mode
#define	MCCI_STM32L0_REG_PWR_CR_DS_EE_KOFF	(UINT32_C(1) << 13)	///< deep sleep mode with nv mem off

#define	MCCI_STM32L0_REG_PWR_CR_VOS		(UINT32_C(3) << 11)	///< voltage scaling range
# define MCCI_STM32L0_REG_PWR_CR_VOS_NC		MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_PWR_CR_VOS, 0)	///< no change / not allowed
# define MCCI_STM32L0_REG_PWR_CR_VOS_1V8	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_PWR_CR_VOS, 1)	///< 1.8V
# define MCCI_STM32L0_REG_PWR_CR_VOS_1V5	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_PWR_CR_VOS, 2)	///< 1.5V
# define MCCI_STM32L0_REG_PWR_CR_VOS_1V2	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_PWR_CR_VOS, 3)	///< 1.2V

#define	MCCI_STM32L0_REG_PWR_CR_FWU		(UINT32_C(1) << 10)	///< fast wakeup
#define	MCCI_STM32L0_REG_PWR_CR_ULP		(UINT32_C(1) << 9)	///< ultra low-power mode
#define	MCCI_STM32L0_REG_PWR_CR_DBP		(UINT32_C(1) << 8)	///< disable backup write protection

