mcci-catena/bootloader/platform/soc/stm32l0/i/mcci_stm32l0xx.h
#define	MCCI_STM32L0_REG_PWR_CR_PLS		(UINT32_C(7) << 5)	///< power voltage detector level
# define MCCI_STM32L0_REG_PWR_CR_PLS_1V9	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_PWR_CR_PLS, 0)	///< 1.9 V
# define MCCI_STM32L0_REG_PWR_CR_PLS_2V1	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_PWR_CR_PLS, 1)	///< 2.1 V
# define MCCI_STM32L0_REG_PWR_CR_PLS_2V3	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_PWR_CR_PLS, 2)	///< 2.3 V
# define MCCI_STM32L0_REG_PWR_CR_PLS_2V5	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_PWR_CR_PLS, 3)	///< 2.5 V
# define MCCI_STM32L0_REG_PWR_CR_PLS_2V7	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_PWR_CR_PLS, 4)	///< 2.7 V
# define MCCI_STM32L0_REG_PWR_CR_PLS_2V9	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_PWR_CR_PLS, 5)	///< 2.9 V
# define MCCI_STM32L0_REG_PWR_CR_PLS_3V1	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_PWR_CR_PLS, 6)	///< 3.1 V
# define MCCI_STM32L0_REG_PWR_CR_PLS_EXT	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_PWR_CR_PLS, 7)	///< Vrefint

#define	MCCI_STM32L0_REG_PWR_CR_PVDE		(UINT32_C(1) << 4)	///< power voltage detector enabled
#define	MCCI_STM32L0_REG_PWR_CR_CSBF		(UINT32_C(1) << 3)	///< clear the SBF standby flag
#define	MCCI_STM32L0_REG_PWR_CR_CWUF		(UINT32_C(1) << 2)	///< clear the wakeup flag
#define	MCCI_STM32L0_REG_PWR_CR_PDDS		(UINT32_C(1) << 1)	///< power-down deep sleep
#define	MCCI_STM32L0_REG_PWR_CR_LPSDSR		(UINT32_C(1) << 0)	///< low-power deep sleep/sleep/low-power run
/// @}

/// \name PWR_SCR bits
///	@{
#define MCCI_STM32L0_REG_PWR_CSR_RSV11		UINT32C(0xFFFFF800)	///< reserved, do not change
#define MCCI_STM32L0_REG_PWR_CSR_EWUP3		(UINT32_C(1) << 10)	///< Enable WKUP pin 3
#define MCCI_STM32L0_REG_PWR_CSR_EWUP2		(UINT32_C(1) << 9)	///< Enable WKUP pin 2
#define MCCI_STM32L0_REG_PWR_CSR_EWUP1		(UINT32_C(1) << 8)	///< Enable WKUP pin 1
#define MCCI_STM32L0_REG_PWR_CSR_RSV6		(UINT32_C(3) << 6)	///< Reserved, do not change
#define MCCI_STM32L0_REG_PWR_CSR_REGLPF		(UINT32_C(1) << 5)	///< Regulator low-power flag
#define MCCI_STM32L0_REG_PWR_CSR_VOSF		(UINT32_C(1) << 4)	///< Voltage scaling select flag
#define MCCI_STM32L0_REG_PWR_CSR_VREFINTRDYF	(UINT32_C(1) << 3)	///< Vrefint ready flag
#define MCCI_STM32L0_REG_PWR_CSR_PVDO	 	(UINT32_C(1) << 2)	///< PVD output
#define MCCI_STM32L0_REG_PWR_CSR_SBF	 	(UINT32_C(1) << 1)	///< Standby flag
#define MCCI_STM32L0_REG_PWR_CSR_WUF		(UINT32_C(1) << 0)	///< Wakeup flag
///	@}

/****************************************************************************\
|
|	Reset and Clock Control (RCC) Registers
|
\****************************************************************************/

/// \name RCC registers
///	@{
#define	MCCI_STM32L0_REG_RCC_CR		(MCCI_STM32L0_REG_RCC + 0x00)	///< Clock control
#define	MCCI_STM32L0_REG_RCC_ICSCR	(MCCI_STM32L0_REG_RCC + 0x04)	///< Internal clock sources calibration
#define	MCCI_STM32L0_REG_RCC_CRRCR	(MCCI_STM32L0_REG_RCC + 0x08)	///< Clock recovery RC
#define	MCCI_STM32L0_REG_RCC_CFGR	(MCCI_STM32L0_REG_RCC + 0x0C)	///< Clock configuration
#define	MCCI_STM32L0_REG_RCC_CIER	(MCCI_STM32L0_REG_RCC + 0x10)	///< Clock interrupt enable
#define	MCCI_STM32L0_REG_RCC_CIFR	(MCCI_STM32L0_REG_RCC + 0x14)	///< Clock interrupt flag
#define	MCCI_STM32L0_REG_RCC_CICR	(MCCI_STM32L0_REG_RCC + 0x18)	///< Clock interrupt clear
#define	MCCI_STM32L0_REG_RCC_IOPRSTR	(MCCI_STM32L0_REG_RCC + 0x1C)	///< GPIO reset
#define	MCCI_STM32L0_REG_RCC_AHBRSTR	(MCCI_STM32L0_REG_RCC + 0x20)	///< AHB peripheral reset
#define	MCCI_STM32L0_REG_RCC_APB2RSTR	(MCCI_STM32L0_REG_RCC + 0x24)	///< APB2 peripheral reset
#define	MCCI_STM32L0_REG_RCC_APB1RSTR	(MCCI_STM32L0_REG_RCC + 0x28)	///< APB1 peripheral reset
#define	MCCI_STM32L0_REG_RCC_IOPENR	(MCCI_STM32L0_REG_RCC + 0x2C)	///< GPIO clock enable
#define	MCCI_STM32L0_REG_RCC_AHBENR	(MCCI_STM32L0_REG_RCC + 0x30)	///< AHB peripheral clock enable
#define	MCCI_STM32L0_REG_RCC_APB2ENR	(MCCI_STM32L0_REG_RCC + 0x34)	///< APB2 peripheral clock enable
#define	MCCI_STM32L0_REG_RCC_APB1ENR	(MCCI_STM32L0_REG_RCC + 0x38)	///< APB1 peripheral clock enable
#define	MCCI_STM32L0_REG_RCC_IOPSMEN	(MCCI_STM32L0_REG_RCC + 0x3C)	///< GPIO clock enable in sleep
#define	MCCI_STM32L0_REG_RCC_AHBSMENR	(MCCI_STM32L0_REG_RCC + 0x40)	///< AHB peripheral clock enable in sleep
#define	MCCI_STM32L0_REG_RCC_APB2SMENR	(MCCI_STM32L0_REG_RCC + 0x44)	///< APB2 peripheral clock enable in sleep
#define	MCCI_STM32L0_REG_RCC_APB1SMENR	(MCCI_STM32L0_REG_RCC + 0x48)	///< APB1 peripheral clock enable in sleep
#define	MCCI_STM32L0_REG_RCC_CCIPR	(MCCI_STM32L0_REG_RCC + 0x4C)	///< Clock configuration CCIPR
#define	MCCI_STM32L0_REG_RCC_CSR	(MCCI_STM32L0_REG_RCC + 0x50)	///< Control/status
///	@}

/// \name RCC_CR bits
///	@{
#define MCCI_STM32L0_REG_RCC_CR_RSV26		UINT32_C(0xFC000000)	//< reserved, no change
#define MCCI_STM32L0_REG_RCC_CR_PLLRDY		(UINT32_C(1) << 25)	//< PLL clock is ready
#define MCCI_STM32L0_REG_RCC_CR_PLLON		(UINT32_C(1) << 24)	//< PLL enable
#define MCCI_STM32L0_REG_RCC_CR_RSV22		(UINT32_C(3) << 22)	//< reserved, no change
#define MCCI_STM32L0_REG_RCC_CR_RTCPRE		(UINT32_C(3) << 20)	//< RTC prescalers
#define MCCI_STM32L0_REG_RCC_CR_RTCPRE_2	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_PWR_CR_PLSMCCI_STM32L0_REG_RCC_CR_RTCPRE, 0)
#define MCCI_STM32L0_REG_RCC_CR_RTCPRE_4	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_PWR_CR_PLSMCCI_STM32L0_REG_RCC_CR_RTCPRE, 1)
#define MCCI_STM32L0_REG_RCC_CR_RTCPRE_8	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_PWR_CR_PLSMCCI_STM32L0_REG_RCC_CR_RTCPRE, 2)
#define MCCI_STM32L0_REG_RCC_CR_RTCPRE_16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_PWR_CR_PLSMCCI_STM32L0_REG_RCC_CR_RTCPRE, 3)
#define MCCI_STM32L0_REG_RCC_CR_CSSHSEON	(UINT32_C(1) << 19)	//< enable clock security HSE
#define MCCI_STM32L0_REG_RCC_CR_HSEBYP		(UINT32_C(1) << 18)	//< enable HSE clock bypass
#define MCCI_STM32L0_REG_RCC_CR_HSERDY		(UINT32_C(1) << 17)	//< HSE clock ready
#define MCCI_STM32L0_REG_RCC_CR_HSEON		(UINT32_C(1) << 16)	//< HSE enabled
#define MCCI_STM32L0_REG_RCC_CR_RSV10		UINT32_C(0x0000FC00)	//< reserved, no change
#define MCCI_STM32L0_REG_RCC_CR_MSIRDY		(UINT32_C(1) << 9)	//< MSI clock ready
#define MCCI_STM32L0_REG_RCC_CR_MSION		(UINT32_C(1) << 8)	//< MSI clock on
#define MCCI_STM32L0_REG_RCC_CR_RSV6		(UINT32_C(3) << 6)	//< reserved, no change
#define MCCI_STM32L0_REG_RCC_CR_HSI16OUTEN	(UINT32_C(1) << 5)	//< enable HSI16 output to TIM2
#define MCCI_STM32L0_REG_RCC_CR_HSI16DIVF	(UINT32_C(1) << 4)	//< HSI16 is being divided by 4 (status)
#define MCCI_STM32L0_REG_RCC_CR_HSI16DIVEN	(UINT32_C(1) << 3)	//< Divide HSI16 by 4 (control)
#define MCCI_STM32L0_REG_RCC_CR_HSI16RDYF	(UINT32_C(1) << 2)	//< HSI16 is stable
#define MCCI_STM32L0_REG_RCC_CR_HSI16KERON	(UINT32_C(1) << 1)	//< force HSI16 on during stop
#define MCCI_STM32L0_REG_RCC_CR_HSI16ON		(UINT32_C(1) << 0)	//< enable HSI16
///	@}

/// \name RCC_ICSCR bits
///	@{
#define MCCI_STM32L0_REG_RCC_ICSCR_MSITRIM	(UINT32_C(0xFF) << 24)	//< MSI clock trimming
#define MCCI_STM32L0_REG_RCC_ICSCR_MSICAL	(UINT32_C(0xFF) << 16)	//< MSI clock cal

#define MCCI_STM32L0_REG_RCC_ICSCR_MSIRANGE	(UINT32_C(7) << 13)	//< MSI clock ranges
#define MCCI_STM32L0_REG_RCC_ICSCR_MSIRANGE_65k		MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_ICSCR_MSIRANGE, 0)	//< 65.536 kHz
#define MCCI_STM32L0_REG_RCC_ICSCR_MSIRANGE_131k	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_ICSCR_MSIRANGE, 1)	//< 131.072 kHz
#define MCCI_STM32L0_REG_RCC_ICSCR_MSIRANGE_262k	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_ICSCR_MSIRANGE, 2)	//< 262.144 kHz
#define MCCI_STM32L0_REG_RCC_ICSCR_MSIRANGE_524k	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_ICSCR_MSIRANGE, 3)	//< 524.288 kHz
#define MCCI_STM32L0_REG_RCC_ICSCR_MSIRANGE_1048k	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_ICSCR_MSIRANGE, 4)	//< 1.048 MHz
#define MCCI_STM32L0_REG_RCC_ICSCR_MSIRANGE_2097k	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_ICSCR_MSIRANGE, 5)	//< 2.097 MHz
#define MCCI_STM32L0_REG_RCC_ICSCR_MSIRANGE_4194k	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_ICSCR_MSIRANGE, 6)	//< 4.194 MHz

#define MCCI_STM32L0_REG_RCC_ICSCR_HSI16TRIM	(UINT32_C(0x1F) << 8)	//< HSI16 trim
#define MCCI_STM32L0_REG_RCC_ICSCR_HSI16CAL	(UINT32_C(0xFF) << 0)	//< HSI16 clock cal
///	@}

