mcci-catena/bootloader/platform/soc/stm32l0/i/mcci_stm32l0xx.h
/// \name RCC_CRRCR bits
///	@{
#define MCCI_STM32L0_REG_RCC_CRRCR_RSV16	UINT32_C(0xFFFF0000)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_CRRCR_HSI48CAL	(UINT32_C(0xFF) << 8)	//< calibration for HSI48
#define MCCI_STM32L0_REG_RCC_CRRCR_RSV3		UINT32_C(0xF8)		//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_CRRCR_HSI48DIVEN	(UINT32_C(1) << 2)	//< deliver HSI48/6 to TIM3
#define MCCI_STM32L0_REG_RCC_CRRCR_HSI48RDY	(UINT32_C(1) << 1)	//< 48 MHz clock ready
#define MCCI_STM32L0_REG_RCC_CRRCR_HSI48ON	(UINT32_C(1) << 0)	//< 48 MHz clock enable
///	@}

/// \name RCC_CFGR bits
///	@{
#define MCCI_STM32L0_REG_RCC_CFGR_RSV31		(UINT32_C(1) << 31)	//< reserved, don't change

#define MCCI_STM32L0_REG_RCC_CFGR_MCOPRE	(UINT32_C(7) << 28)	//< Clock output prescaler
#define MCCI_STM32L0_REG_RCC_CFGR_MCOPRE_1	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOPRE, 0)	//< prescale MCO divide by 1
#define MCCI_STM32L0_REG_RCC_CFGR_MCOPRE_2	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOPRE, 1)	//< prescale MCO divide by 2
#define MCCI_STM32L0_REG_RCC_CFGR_MCOPRE_4	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOPRE, 2)	//< prescale MCO divide by 4
#define MCCI_STM32L0_REG_RCC_CFGR_MCOPRE_8	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOPRE, 3)	//< prescale MCO divide by 6
#define MCCI_STM32L0_REG_RCC_CFGR_MCOPRE_16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOPRE, 4)	//< prescale MCO divide by 16

#define MCCI_STM32L0_REG_RCC_CFGR_MCOSEL	(UINT32_C(0xF) << 24)	//< Clock output selection
#define MCCI_STM32L0_REG_RCC_CFGR_MCOSEL_OFF	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOSEL, 0)	//< Clock output disabled
#define MCCI_STM32L0_REG_RCC_CFGR_MCOSEL_SYSCLK	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOSEL, 1)	//< MCO from Sysclk
#define MCCI_STM32L0_REG_RCC_CFGR_MCOSEL_HSI16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOSEL, 2)	//< MCO from HSI16
#define MCCI_STM32L0_REG_RCC_CFGR_MCOSEL_MSI	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOSEL, 3)	//< MCO from MSI
#define MCCI_STM32L0_REG_RCC_CFGR_MCOSEL_HSE	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOSEL, 4)	//< MCO from HSE
#define MCCI_STM32L0_REG_RCC_CFGR_MCOSEL_PLL	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOSEL, 5)	//< MCO from PLL
#define MCCI_STM32L0_REG_RCC_CFGR_MCOSEL_LSI	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOSEL, 6)	//< MCO from LSI
#define MCCI_STM32L0_REG_RCC_CFGR_MCOSEL_LSE	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOSEL, 7)	//< MCO from LSE
#define MCCI_STM32L0_REG_RCC_CFGR_MCOSEL_HSI48	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_MCOSEL, 8)	//< MCO from HSI48

#define MCCI_STM32L0_REG_RCC_CFGR_PLLDIV	(UINT32_C(3) << 22)	//< PLL divisor
#define MCCI_STM32L0_REG_RCC_CFGR_PLLDIV_2	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PLLDIV, 1)	//< PLL: divide by 2
#define MCCI_STM32L0_REG_RCC_CFGR_PLLDIV_3	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PLLDIV, 2)	//< PLL: divide by 3
#define MCCI_STM32L0_REG_RCC_CFGR_PLLDIV_4	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PLLDIV, 3)	//< PLL: divide by 4
#define MCCI_STM32L0_REG_RCC_CFGR_PLLMUL	(UINT32_C(0xF) << 18)	//< PLL multiplier
#define MCCI_STM32L0_REG_RCC_CFGR_PLLMUL_3	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PLLMUL, 0)	//< PLL: multiply by 3
#define MCCI_STM32L0_REG_RCC_CFGR_PLLMUL_4	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PLLMUL, 1)	//< PLL: multiply by 4
#define MCCI_STM32L0_REG_RCC_CFGR_PLLMUL_6	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PLLMUL, 2)	//< PLL: multiply by 6
#define MCCI_STM32L0_REG_RCC_CFGR_PLLMUL_8	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PLLMUL, 3)	//< PLL: multiply by 8
#define MCCI_STM32L0_REG_RCC_CFGR_PLLMUL_12	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PLLMUL, 4)	//< PLL: multiply by 12
#define MCCI_STM32L0_REG_RCC_CFGR_PLLMUL_16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PLLMUL, 5)	//< PLL: multiply by 16
#define MCCI_STM32L0_REG_RCC_CFGR_PLLMUL_24	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PLLMUL, 6)	//< PLL: multiply by 24
#define MCCI_STM32L0_REG_RCC_CFGR_PLLMUL_32	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PLLMUL, 7)	//< PLL: multiply by 32
#define MCCI_STM32L0_REG_RCC_CFGR_PLLMUL_48	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PLLMUL, 8)	//< PLL: multiply by 48
#define MCCI_STM32L0_REG_RCC_CFGR_RSV17		(UINT32_C(1) << 17)	//< reserved, don't change

#define MCCI_STM32L0_REG_RCC_CFGR_PLLSRC	(UINT32_C(1) << 16)	//< PLL clock source
#define  MCCI_STM32L0_REG_RCC_CFGR_PLLSRC_HSI16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PLLSRC, 0)	//< PLL clock source: HSI16
#define  MCCI_STM32L0_REG_RCC_CFGR_PLLMUL_HSE	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PLLSRC, 1)	//< PLL clock source: HSE

#define MCCI_STM32L0_REG_RCC_CFGR_STOPWUCK	(UINT32_C(1) << 15)	//< Wakeup from stop clock
#define  MCCI_STM32L0_REG_RCC_CFGR_STOPWUCK_MSI		MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_STOPWUCK, 0)	//< Wakeup from stop clock: MSI
#define  MCCI_STM32L0_REG_RCC_CFGR_STOPWUCK_HSI16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_STOPWUCK, 1)	//< Wakeup from stop clock: HSI16

#define MCCI_STM32L0_REG_RCC_CFGR_RSV14		(UINT32_C(1) << 14)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_CFGR_PPRE2		(UINT32_C(7) << 11)	//< APB high-speed prescaler
#define MCCI_STM32L0_REG_RCC_CFGR_PPRE2_1	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PPRE2, 0)	//< AHB high-speed prescaler: not divided
#define MCCI_STM32L0_REG_RCC_CFGR_PPRE2_2	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PPRE2, 4)	//< AHB high-speed prescaler: divide by 2
#define MCCI_STM32L0_REG_RCC_CFGR_PPRE2_4	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PPRE2, 5)	//< AHB high-speed prescaler: divide by 4
#define MCCI_STM32L0_REG_RCC_CFGR_PPRE2_8	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PPRE2, 6)	//< AHB high-speed prescaler: divide by 8
#define MCCI_STM32L0_REG_RCC_CFGR_PPRE2_16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PPRE2, 7)	//< AHB high-speed prescaler: divide by 16
#define MCCI_STM32L0_REG_RCC_CFGR_PPRE1		(UINT32_C(7) << 8)	//< APB low-speed prescaler
#define MCCI_STM32L0_REG_RCC_CFGR_PPRE1_1	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PPRE1, 0)	//< APB low-speed prescaler: none
#define MCCI_STM32L0_REG_RCC_CFGR_PPRE1_2	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PPRE1, 4)	//< APB low-speed prescaler: divide by 2
#define MCCI_STM32L0_REG_RCC_CFGR_PPRE1_4	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PPRE1, 5)	//< APB low-speed prescaler: divide by 4
#define MCCI_STM32L0_REG_RCC_CFGR_PPRE1_8	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PPRE1, 6)	//< APB low-speed prescaler: divide by 8
#define MCCI_STM32L0_REG_RCC_CFGR_PPRE1_16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_PPRE1, 7)	//< APB low-speed prescaler: divide by 16
#define MCCI_STM32L0_REG_RCC_CFGR_HPRE		(UINT32_C(0xF) << 4)	//< AHB prescaler
#define MCCI_STM32L0_REG_RCC_CFGR_HPRE_1	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_HPRE, 0)	//< AHB prescaler: SYSCLK not divided
#define MCCI_STM32L0_REG_RCC_CFGR_HPRE_2	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_HPRE, 8)	//< AHB prescaler: SYSCLK / 2
#define MCCI_STM32L0_REG_RCC_CFGR_HPRE_4	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_HPRE, 9)	//< AHB prescaler: SYSCLK / 4
#define MCCI_STM32L0_REG_RCC_CFGR_HPRE_8	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_HPRE, 10)	//< AHB prescaler: SYSCLK / 8
#define MCCI_STM32L0_REG_RCC_CFGR_HPRE_16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_HPRE, 11)	//< AHB prescaler: SYSCLK / 16
#define MCCI_STM32L0_REG_RCC_CFGR_HPRE_64	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_HPRE, 12)	//< AHB prescaler: SYSCLK / 64
#define MCCI_STM32L0_REG_RCC_CFGR_HPRE_128	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_HPRE, 13)	//< AHB prescaler: SYSCLK / 128
#define MCCI_STM32L0_REG_RCC_CFGR_HPRE_256	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_HPRE, 14)	//< AHB prescaler: SYSCLK / 256
#define MCCI_STM32L0_REG_RCC_CFGR_HPRE_512	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_HPRE, 15)	//< AHB prescaler: SYSCLK / 512
#define MCCI_STM32L0_REG_RCC_CFGR_SWS		(UINT32_C(3) << 2)	//< SYSCLK switch status
#define MCCI_STM32L0_REG_RCC_CFGR_SWS_MSI	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_SWS, 0)	//< SYSCLK using MSI
#define MCCI_STM32L0_REG_RCC_CFGR_SWS_HSI16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_SWS, 1)	//< SYSCLK using HSI16
#define MCCI_STM32L0_REG_RCC_CFGR_SWS_HSE	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_SWS, 2)	//< SYSCLK using HSE
#define MCCI_STM32L0_REG_RCC_CFGR_SWS_PLL	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_SWS, 3)	//< SYSCLK using PLLL
#define MCCI_STM32L0_REG_RCC_CFGR_SW		(UINT32_C(3) << 0)	//< SYSCLK source select
#define MCCI_STM32L0_REG_RCC_CFGR_SW_MSI	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_SW, 0)	//< SYSCLK: use MSI
#define MCCI_STM32L0_REG_RCC_CFGR_SW_HSI16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_SW, 1)	//< SYSCLK: use HSI16
#define MCCI_STM32L0_REG_RCC_CFGR_SW_HSE	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_SW, 2)	//< SYSCLK: use HSE
#define MCCI_STM32L0_REG_RCC_CFGR_SW_PLL	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CFGR_SW, 3)	//< SYSCLK: use PLL
///	@}

/// \name RCC_CIER bits
///	@{
#define MCCI_STM32L0_REG_RCC_CIER_RSV8		UINT32_C(0xFFFFFF00)
#define MCCI_STM32L0_REG_RCC_CIER_CSSLSE	(UINT32_C(1) << 7)
#define MCCI_STM32L0_REG_RCC_CIER_HSI48RDYIE	(UINT32_C(1) << 6)
#define MCCI_STM32L0_REG_RCC_CIER_MSIRDYIE	(UINT32_C(1) << 5)
#define MCCI_STM32L0_REG_RCC_CIER_PLLRDYIE	(UINT32_C(1) << 4)
#define MCCI_STM32L0_REG_RCC_CIER_HSERDYIE	(UINT32_C(1) << 3)
#define MCCI_STM32L0_REG_RCC_CIER_HSI16RDYIE	(UINT32_C(1) << 2)
#define MCCI_STM32L0_REG_RCC_CIER_LSERDYIE	(UINT32_C(1) << 1)
#define MCCI_STM32L0_REG_RCC_CIER_LSIRDYIE	(UINT32_C(1) << 0)
///	@}

