mcci-catena/bootloader/platform/soc/stm32l0/i/mcci_stm32l0xx.h
/// \name RCC_CCIPR bits
///	@{
#define MCCI_STM32L0_REG_RCC_CCIPR_RSV27	(UINT32_C(0x1F) << 27)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_CCIPR_HSI48SEL	(UINT32_C(1) << 26)	//< HSI48 from PLL USB (not RC48)
#define MCCI_STM32L0_REG_RCC_CCIPR_RSV20	(UINT32_C(0x3F) << 20)	//< reserved, don't change

#define MCCI_STM32L0_REG_RCC_CCIPR_LPTIM1SEL	(UINT32_C(3) << 18)	//< select LPTIM1 srt
#define  MCCI_STM32L0_REG_RCC_CCIPR_LPTIM1SEL_APB	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_LPTIM1SEL, 0)	//< APB clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_LPTIM1SEL_LSI	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_LPTIM1SEL, 1)	//< LSI clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_LPTIM1SEL_HSI16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_LPTIM1SEL, 2)	//< HSI16 clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_LPTIM1SEL_LSE	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_LPTIM1SEL, 3)	//< LSE clock

#define MCCI_STM32L0_REG_RCC_CCIPR_I2C3SEL	(UINT32_C(3) << 16)	//<
#define  MCCI_STM32L0_REG_RCC_CCIPR_I2C3SEL_APB		MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_I2C3SEL, 0)	//< APB clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_I2C3SEL_LSI		MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_I2C3SEL, 1)	//< LSI clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_I2C3SEL_HSI16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_I2C3SEL, 2)	//< HSI16 clock

#define MCCI_STM32L0_REG_RCC_CCIPR_RSV14	(UINT32_C(3) << 14)	//< reserved, don't change
#define MCCI_STM32L0_REG_RCC_CCIPR_I2C1SEL	(UINT32_C(3) << 12)	//<
#define  MCCI_STM32L0_REG_RCC_CCIPR_I2C1SEL_APB		MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_I2C1SEL, 0)	//< APB clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_I2C1SEL_LSI		MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_I2C1SEL, 1)	//< LSI clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_I2C1SEL_HSI16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_I2C1SEL, 2)	//< HSI16 clock

#define MCCI_STM32L0_REG_RCC_CCIPR_LPUART1SEL	(UINT32_C(3) << 10)	//<
#define  MCCI_STM32L0_REG_RCC_CCIPR_LPUART1SEL_APB	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_LPUART1SEL, 0)	//< APB clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_LPUART1SEL_LSI	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_LPUART1SEL, 1)	//< LSI clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_LPUART1SEL_HSI16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_LPUART1SEL, 2)	//< HSI16 clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_LPUART1SEL_LSE	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_LPUART1SEL, 3)	//< LSE clock

#define MCCI_STM32L0_REG_RCC_CCIPR_RSV4		(UINT32_C(0x3F) << 4)	//< reserved, don't change

#define MCCI_STM32L0_REG_RCC_CCIPR_USART2SEL	(UINT32_C(3) << 2)	//<
#define  MCCI_STM32L0_REG_RCC_CCIPR_USART2SEL_APB	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_USART2SEL, 0)	//< APB clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_USART2SEL_LSI	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_USART2SEL, 1)	//< LSI clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_USART2SEL_HSI16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_USART2SEL, 2)	//< HSI16 clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_USART2SEL_LSE	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_USART2SEL, 3)	//< LSE clock

#define MCCI_STM32L0_REG_RCC_CCIPR_USART1SEL	(UINT32_C(3) << 0)	//<
#define  MCCI_STM32L0_REG_RCC_CCIPR_USART1SEL_APB	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_USART1SEL, 0)	//< APB clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_USART1SEL_LSI	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_USART1SEL, 1)	//< LSI clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_USART1SEL_HSI16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_USART1SEL, 2)	//< HSI16 clock
#define  MCCI_STM32L0_REG_RCC_CCIPR_USART1SEL_LSE	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CCIPR_USART1SEL, 3)	//< LSE clock
///	@}

/// \name RCC_CSR bits
///	@{
#define  MCCI_STM32L0_REG_RCC_CSR_LPWRRSTF	(UINT32_C(1) << 31)	//< Reset due to low-power
#define  MCCI_STM32L0_REG_RCC_CSR_WWDGRSTF	(UINT32_C(1) << 30)	//< reset due to window watchdog
#define  MCCI_STM32L0_REG_RCC_CSR_IWDGRSTF	(UINT32_C(1) << 29)	//< reset due to independent watchdog
#define  MCCI_STM32L0_REG_RCC_CSR_SFTRSTF	(UINT32_C(1) << 28)	//< reset due to softwaare
#define  MCCI_STM32L0_REG_RCC_CSR_PORRSTF	(UINT32_C(1) << 27)	//< reset due to power: POR, PDR
#define  MCCI_STM32L0_REG_RCC_CSR_PINRSTF	(UINT32_C(1) << 26)	//< reset due to NRST pin
#define  MCCI_STM32L0_REG_RCC_CSR_OBLRSTF	(UINT32_C(1) << 25)	//< reset due to option byte loading
#define  MCCI_STM32L0_REG_RCC_CSR_FWRSTF	(UINT32_C(1) << 24)	//< reset due to firewall
#define  MCCI_STM32L0_REG_RCC_CSR_RMVF		(UINT32_C(1) << 23)	//< remove reset (clears flags)
#define  MCCI_STM32L0_REG_RCC_CSR_RSV20		(UINT32_C(7) << 20)	//< Reserved, don't change
#define  MCCI_STM32L0_REG_RCC_CSR_RTCRST	(UINT32_C(1) << 19)	//< reset RTC and backup
#define  MCCI_STM32L0_REG_RCC_CSR_RTCEN		(UINT32_C(1) << 18)	//< enable RTC

#define  MCCI_STM32L0_REG_RCC_CSR_RTCSEL	(UINT32_C(3) << 16)	//< RTC clock source select
#define   MCCI_STM32L0_REG_RCC_CSR_RTCSEL_NONE	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CSR_RTCSEL, 0)	//< no RTC clock
#define   MCCI_STM32L0_REG_RCC_CSR_RTCSEL_LSE	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CSR_RTCSEL, 0)	//< LSE clock as RTC clock
#define   MCCI_STM32L0_REG_RCC_CSR_RTCSEL_LSI	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CSR_RTCSEL, 0)	//< LSI clock as RTC clock
#define   MCCI_STM32L0_REG_RCC_CSR_RTCSEL_HSE	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CSR_RTCSEL, 0)	//< HSE clock divided as RTC clock

#define  MCCI_STM32L0_REG_RCC_CSR_RSV15		(UINT32_C(1) << 15)	//< Reserved, don't change
#define  MCCI_STM32L0_REG_RCC_CSR_CSSLSED	(UINT32_C(1) << 14)	//< CSS on LSE failure
#define  MCCI_STM32L0_REG_RCC_CSR_CSSLSEON	(UINT32_C(1) << 13)	//< CSS on LSE enable

#define  MCCI_STM32L0_REG_RCC_CSR_LSEDRV	(UINT32_C(3) << 11)	//< LSE drive
#define   MCCI_STM32L0_REG_RCC_CSR_LSEDRV_LOW	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CSR_LSEDRV, 0)	//< LSE drive: lowest
#define   MCCI_STM32L0_REG_RCC_CSR_LSEDRV_M1	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CSR_LSEDRV, 1)	//< LSE drive: medium low
#define   MCCI_STM32L0_REG_RCC_CSR_LSEDRV_M2	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CSR_LSEDRV, 2)	//< LSE drive: medium high
#define   MCCI_STM32L0_REG_RCC_CSR_LSEDRV_HIGH	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_REG_RCC_CSR_LSEDRV, 3)	//< LSE drive: highest

#define  MCCI_STM32L0_REG_RCC_CSR_LSEBYP	(UINT32_C(1) << 10)	//< external LSE bypass
#define  MCCI_STM32L0_REG_RCC_CSR_LSERDY	(UINT32_C(1) << 9)	//< LSE ready
#define  MCCI_STM32L0_REG_RCC_CSR_LSEON		(UINT32_C(1) << 8)	//< LSE enable
#define  MCCI_STM32L0_REG_RCC_CSR_RSV2		(UINT32_C(0x3F) << 2)	//< Reserved, don't change
#define  MCCI_STM32L0_REG_RCC_CSR_LSIRDY	(UINT32_C(1) << 1)	//< LSI ready
#define  MCCI_STM32L0_REG_RCC_CSR_LSION		(UINT32_C(1) << 0)	//< LSI enable
///	@}

/****************************************************************************\
|
|	GPIO Control Registers
|
\****************************************************************************/

/// \name GPIO register offsets
///	@{
#define MCCI_STM32L0_GPIO_MODER		UINT32_C(0x00)	//< port mode register
#define MCCI_STM32L0_GPIO_OTYPER	UINT32_C(0x04)	//< port output type register
#define MCCI_STM32L0_GPIO_OSPEEDR	UINT32_C(0x08)	//< port output speed register
#define MCCI_STM32L0_GPIO_PUPDR		UINT32_C(0x0C)	//< port pull-up/pull-down register
#define MCCI_STM32L0_GPIO_IDR		UINT32_C(0x10)	//< port input data register
#define MCCI_STM32L0_GPIO_ODR		UINT32_C(0x14)	//< port output data register
#define MCCI_STM32L0_GPIO_BSRR		UINT32_C(0x18)	//< port bit set/reset register
#define MCCI_STM32L0_GPIO_LCKR		UINT32_C(0x1C)	//< port configuration lock register
#define MCCI_STM32L0_GPIO_AFRL		UINT32_C(0x20)	//< port alternate function low register
#define MCCI_STM32L0_GPIO_AFRH		UINT32_C(0x24)	//< port alternate function high register
#define MCCI_STM32L0_GPIO_BRR		UINT32_C(0x28)	//< port bit reset register
///	@}

/// \name GPIO_MODER bits -- used to select pin mode, two bits per pin
///	@{
#define MCCI_STM32L0_GPIO_MODE_MASK	UINT32_C(3)	//< mode bit masks
#define MCCI_STM32L0_GPIO_MODE_IN	UINT32_C(0)	//< digital input
#define MCCI_STM32L0_GPIO_MODE_OUT	UINT32_C(1)	//< digital output
#define MCCI_STM32L0_GPIO_MODE_AF	UINT32_C(2)	//< alternate function
#define MCCI_STM32L0_GPIO_MODE_ANALOG	UINT32_C(3)	//< analog
///	@}

/// \brief compute the mask for the mode bits for port bits 0..15
///
/// Normally we compute a mask using an expression like:
///
///	`MCCI_BOOTLOADER_FIELD_SET_VALUE(
///		MCCI_STM32L0_GPIO_MODE_P(3),
///		MCCI_STM32L0_GPIO_MODE_IN
///		)`
///
#define	MCCI_STM32L0_GPIO_MODE_P(p)	(UINT32_C(3) << (2 * (p)))

/// \name GPIO_OTYPER bits
///	@{
#define	MCCI_STM32L0_GPIO_OTYPE_PP	UINT32_C(0)	//< Output is push-pull (totem-pole)
#define	MCCI_STM32L0_GPIO_OTYPE_OD	UINT32_C(1)	//< Output is open drain (pull-down only)
///	@}

/// \brief compute the mask for the mode bits for port bits 0..15
///
/// Normally we compute a mask using an expression like:
///
///	`MCCI_BOOTLOADER_FIELD_SET_VALUE(
///		MCCI_STM32L0_GPIO_OTYPE_P(3), // bit 3 in port
///		MCCI_STM32L0_GPIO_OTYPE_PP
///		)`
///
#define	MCCI_STM32L0_GPIO_OTYPE_P(p)		(UINT32_C(1) << (p))

///
/// \brief directly compute a GPIO OTYPE mask
/// \param p is the bit number in the port
/// \param v is the value (MCCI_STM32L0_GPIO_OTYPE_PP or MCCI_STM32L0_GPIO_OTYPE_OD)
///
#define	MCCI_STM32L0_GPIO_OTYPE_PV(p, v)	(((v) & 1u) << (p))

/// \name GPIO_OSPEEDR bits -- used to select pin speed, two bits per pin
///	@{
#define MCCI_STM32L0_GPIO_OSPEED_MASK	UINT32_C(3)	//< speed bit masks
#define MCCI_STM32L0_GPIO_OSPEED_LOW	UINT32_C(0)	//< low
#define MCCI_STM32L0_GPIO_OSPEED_MEDIUM	UINT32_C(1)	//< medium
#define MCCI_STM32L0_GPIO_OSPEED_HIGH	UINT32_C(2)	//< high
#define MCCI_STM32L0_GPIO_OSPEED_VHIGH	UINT32_C(3)	//< very high

/// \brief compute the mask for the mode bits for port bits 0..15
///
/// Normally we compute a mask using an expression like:
///
///	`MCCI_BOOTLOADER_FIELD_SET_VALUE(
///		MCCI_STM32L0_GPIO_OSPEED_P(3),
///		MCCI_STM32L0_GPIO_OSPEED_IN
///		)`
///
#define	MCCI_STM32L0_GPIO_OSPEED_P(p)	(UINT32_C(3) << (2 * (p)))
///	@}

