mcci-catena/bootloader/platform/soc/stm32l0/i/mcci_stm32l0xx.h
/// \name GPIO_PUPDR bits -- used to select pin pullup/pulldown, two bits per pin
///	@{
#define MCCI_STM32L0_GPIO_PUPD_MASK	UINT32_C(3)	//< pullup/pulldown bit masks
#define MCCI_STM32L0_GPIO_PUPD_NONE	UINT32_C(0)	//< no pullup/pulldown
#define MCCI_STM32L0_GPIO_PUPD_PULLUP	UINT32_C(1)	//< pullup
#define MCCI_STM32L0_GPIO_PUPD_PULLDOWN	UINT32_C(2)	//< pulldown

/// \brief compute the mask for the mode bits for port bits 0..15
///
/// Normally we compute a mask using an expression like:
///
///	`MCCI_BOOTLOADER_FIELD_SET_VALUE(
///		MCCI_STM32L0_GPIO_PUPD_P(3),
///		MCCI_STM32L0_GPIO_PUPD_PULLDOWN
///		)`
///
#define	MCCI_STM32L0_GPIO_PUPD_P(p)	(UINT32_C(3) << (2 * (p)))
///	@}

/// \name GPIO_BSRR bits
///	@{
#define MCCI_STM32L0_GPIO_BSRR_BR0	(UINT32_C(1) << 16)		//< reset port bit 0
#define MCCI_STM32L0_GPIO_BSRR_BR	(UINT32_C(0xFFFF) << 16)	//< mask of port-reset bits
#define MCCI_STM32L0_GPIO_BSRR_BS0	(UINT32_C(1) << 0)		//< set port bit 0
#define MCCI_STM32L0_GPIO_BSRR_BS	(UINT32_C(0xFFFF) << 0)		//< mask of port-set bits
/// \brief compute port-bit reset mask for bit \p p.
#define MCCI_STM32L0_GPIO_BSRR_BR_P(p)	(MCCI_STM32L0_GPIO_BSRR_BR0 << (p))
/// \brief compute port-bit set mask for bit \p p.
#define MCCI_STM32L0_GPIO_BSRR_BS_P(p)	(MCCI_STM32L0_GPIO_BSRR_BS0 << (p))
///	@}

/// \name GPIO_LCKR bits
///	@{
#define	MCCI_STM32L0_GPIO_LCKR_RSV17	UINT32_C(0xFFFE0000)	//< reserved, don't change
#define	MCCI_STM32L0_GPIO_LCKR_LCKK	(UINT32_C(1) << 16)	//< lock key bit; if set, ports are locked.
/// \brief compute GPIO lock bit fmask for bit \p p.
#define	MCCI_STM32L0_GPIO_LCKR_LCK_P(p)	(UINT32_C(1) << (p))
#define	MCCI_STM32L0_GPIO_LCKR_LCK	(UINT32_C(0xFFFF) << 0)	//< mask of port-lock bits.
///	@}

/// \name GPIO_AFRx bits
///	@{
/// \brief get reg offset for GPIO_AFRx for port bit \p p. This is the byte offset
/// relative to the base of the GPIO block.
///
#define	MCCI_STM32L0_GPIO_AFRx_P(p)	(MCCI_STM32L0_GPIO_AFRL + (((p) / 8u) * 4u))

/// \brief get AFRx mask for port bit \p p.
///
/// Normal use:
///	`MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_GPIO_AFSEL_P(bitnum), 0..15)`
///
#define	MCCI_STM32L0_GPIO_AFSEL_P(p)	(UINT32_C(0xF) << (((p) & 7u) * 4u))

/// \brief make a mask of AFRx value \p v for port bit \p p..
#define	MCCI_STM32L0_GPIO_AFSEL_PV(p, v)	(((v) & UINT32_C(0xF)) << (((p) & 7u) * 4u))
///	@}

/****************************************************************************\
|
|	SPI Control Registers
|
\****************************************************************************/

/// \name SPI offsets
///	@{
#define	MCCI_STM32L0_SPI_CR1		UINT32_C(0x00)	///< offset to SPI control register 1
#define MCCI_STM32L0_SPI_CR2		UINT32_C(0x04)	///< offset to SPI control register 2
#define MCCI_STM32L0_SPI_SR		UINT32_C(0x08)	///< offset to SPI status register
#define MCCI_STM32L0_SPI_DR		UINT32_C(0x0C)	///< offset to SPI data register
#define MCCI_STM32L0_SPI_CRCPR		UINT32_C(0x10)	///< offset to SPI CRC polynomial
#define MCCI_STM32L0_SPI_RXCRCR		UINT32_C(0x14)	///< offset to SPI receive CRC
#define MCCI_STM32L0_SPI_TXCRCR		UINT32_C(0x18)	///< offset to SPI transmit CRC
#define MCCI_STM32L0_SPI_I2SCFGR	UINT32_C(0x1C)	///< offset to SPI I2S config register
#define MCCI_STM32L0_SPI_I2SPR		UINT32_C(0x20)	///< offset to SPI I2S prescaler
///	@}

/// \name SPI_CR1 bits
///	@{
#define MCCI_STM32L0_SPI_CR1_RSV16	UINT32_C(0xFFFF0000)	///< reserved
#define MCCI_STM32L0_SPI_CR1_BIDIMODE	(UINT32_C(1) << 15)	///< Bidirectional mode
#define MCCI_STM32L0_SPI_CR1_BIDIOE	(UINT32_C(1) << 14)	///< Bidirectional output enable
#define MCCI_STM32L0_SPI_CR1_CRCEN	(UINT32_C(1) << 13)	///< CRC enabled
#define MCCI_STM32L0_SPI_CR1_CRCNEXT	(UINT32_C(1) << 12)	///< CRC is next
#define MCCI_STM32L0_SPI_CR1_DFF	(UINT32_C(1) << 11)	///< Data frame format (16 bit / not 8 bit)
#define MCCI_STM32L0_SPI_CR1_RXONLY	(UINT32_C(1) << 10)	///< Receive-only mode
#define MCCI_STM32L0_SPI_CR1_SSM	(UINT32_C(1) << 9)	///< software slave management
#define MCCI_STM32L0_SPI_CR1_SSI	(UINT32_C(1) << 8)	///< internal slave select
#define MCCI_STM32L0_SPI_CR1_LSBFIRST	(UINT32_C(1) << 7)	///< LSB first (not MSB)
#define MCCI_STM32L0_SPI_CR1_SPE	(UINT32_C(1) << 6)	///< SPI enabled

#define MCCI_STM32L0_SPI_CR1_BR		(UINT32_C(7) << 3)	///< baud rate control (PCLK divisor)
# define MCCI_STM32L0_SPI_CR1_BR_2	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_CR1_BR, 0)	///< PCLK/2
# define MCCI_STM32L0_SPI_CR1_BR_4	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_CR1_BR, 1)	///< PCLK/4
# define MCCI_STM32L0_SPI_CR1_BR_8	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_CR1_BR, 2)	///< PCLK/8
# define MCCI_STM32L0_SPI_CR1_BR_16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_CR1_BR, 3)	///< PCLK/16
# define MCCI_STM32L0_SPI_CR1_BR_32	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_CR1_BR, 4)	///< PCLK/32
# define MCCI_STM32L0_SPI_CR1_BR_64	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_CR1_BR, 5)	///< PCLK/64
# define MCCI_STM32L0_SPI_CR1_BR_128	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_CR1_BR, 6)	///< PCLK/128
# define MCCI_STM32L0_SPI_CR1_BR_256	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_CR1_BR, 7)	///< PCLK/256

#define MCCI_STM32L0_SPI_CR1_MSTR	(UINT32_C(1) << 2)	///< Master (not slave)
#define MCCI_STM32L0_SPI_CR1_CPOL	(UINT32_C(1) << 1)	///< Clk to 1 when idle (not zero)
#define MCCI_STM32L0_SPI_CR1_CPHA	(UINT32_C(1) << 0)	///< Clock phase: second clock transaction captures (not first)
///	@}

/// \name SPI_CR2 bits
///	@{
#define MCCI_STM32L0_SPI_CR2_RSV8	UINT32_C(0xFFFFFF00)	///< reserved
#define MCCI_STM32L0_SPI_CR2_TXEIE	(UINT32_C(1) << 7)	///< tx empty interrupt enable
#define MCCI_STM32L0_SPI_CR2_RXNEIE	(UINT32_C(1) << 6)	///< rx not empty interrupt enable
#define MCCI_STM32L0_SPI_CR2_ERRIE	(UINT32_C(1) << 5)	///< error interrupt enable
#define MCCI_STM32L0_SPI_CR2_FRF	(UINT32_C(1) << 4)	///< frame format TI (not Motorola)
#define MCCI_STM32L0_SPI_CR2_RSV3	(UINT32_C(1) << 3)	///< reserved, zero
#define MCCI_STM32L0_SPI_CR2_SSOE	(UINT32_C(1) << 2)	///< enable SS in master mode
#define MCCI_STM32L0_SPI_CR2_TXDMAEN	(UINT32_C(1) << 1)	///< tx DMA enable
#define MCCI_STM32L0_SPI_CR2_RXDMAEN	(UINT32_C(1) << 0)	///< rx DMA enable
///	@}

/// \name SPI_SR bits
///	@{
#define MCCI_STM32L0_SPI_SR_RSV9	UINT32_C(0xFFFFFE00)	///< reserved, zero
#define MCCI_STM32L0_SPI_SR_FRE		(UINT32_C(1) << 8)	///< frame error (read to clear)
#define MCCI_STM32L0_SPI_SR_BSY		(UINT32_C(1) << 7)	///< busy
#define MCCI_STM32L0_SPI_SR_OVR		(UINT32_C(1) << 6)	///< overrun
#define MCCI_STM32L0_SPI_SR_MODF	(UINT32_C(1) << 5)	///< mode fault
#define MCCI_STM32L0_SPI_SR_CRCERR	(UINT32_C(1) << 4)	///< CRC error (write zero to clear)
#define MCCI_STM32L0_SPI_SR_UDR		(UINT32_C(1) << 3)	///< underrun
#define MCCI_STM32L0_SPI_SR_CHSIDE	(UINT32_C(1) << 2)	///< channel right (not left)
#define MCCI_STM32L0_SPI_SR_TXE		(UINT32_C(1) << 1)	///< TX buffer empty
#define MCCI_STM32L0_SPI_SR_RXNE	(UINT32_C(1) << 0)	///< RX buffer not-empty
///	@}

/// \name SPI_I2SCFGR bits
///	@{
#define MCCI_STM32L0_SPI_I2SCFGR_RSV13		UINT32_C(0xFFFFE000)	///< reserved (do not change)
#define MCCI_STM32L0_SPI_I2SCFGR_I2SMOD		(UINT32_C(1) << 11)	///< I2S mode (not SPI)
#define MCCI_STM32L0_SPI_I2SCFGR_I2SE		(UINT32_C(1) << 10)	///< I2S enable
#define MCCI_STM32L0_SPI_I2SCFGR_I2SCFG		(UINT32_C(3) << 8)	///< I2S configuration mode
#define MCCI_STM32L0_SPI_I2SCFGR_I2SCFG_STX	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_I2SCFGR_I2SCFG, 0)	///< I2S slave transmit
#define MCCI_STM32L0_SPI_I2SCFGR_I2SCFG_SRX	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_I2SCFGR_I2SCFG, 1)	///< I2S slave receive
#define MCCI_STM32L0_SPI_I2SCFGR_I2SCFG_MTX	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_I2SCFGR_I2SCFG, 2)	///< I2S master transmit
#define MCCI_STM32L0_SPI_I2SCFGR_I2SCFG_MRX	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_I2SCFGR_I2SCFG, 3)	///< I2S master receive
#define MCCI_STM32L0_SPI_I2SCFGR_PCMSYNC	(UINT32_C(1) << 7)	///< Long (not short) PCM frame synchronization
#define MCCI_STM32L0_SPI_I2SCFGR_RSV6		(UINT32_C(1) << 6)	///< reserved, zero
#define MCCI_STM32L0_SPI_I2SCFGR_I2SSTD		(UINT32_C(3) << 4)	///< I2S standard selection
#define MCCI_STM32L0_SPI_I2SCFGR_I2SSTD_PHILIPS	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_I2SCFGR_I2SSTD, 0)	///< Philips standard.
#define MCCI_STM32L0_SPI_I2SCFGR_I2SSTD_LEFT	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_I2SCFGR_I2SSTD, 1)	///< MSB justified
#define MCCI_STM32L0_SPI_I2SCFGR_I2SSTD_RIGHT	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_I2SCFGR_I2SSTD, 2)	///< LSB justified
#define MCCI_STM32L0_SPI_I2SCFGR_I2SSTD_PCM	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_I2SCFGR_I2SSTD, 3)	///< PCM standard
#define MCCI_STM32L0_SPI_I2SCFGR_CKPOL		(UINT32_C(1) << 3)	///< steady state clock polarity high (not low)
#define MCCI_STM32L0_SPI_I2SCFGR_DATLEN		(UINT32_C(3) << 1)	///< data length
#define MCCI_STM32L0_SPI_I2SCFGR_DATLEN_16	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_I2SCFGR_DATLEN, 0)	///< 16-bit data
#define MCCI_STM32L0_SPI_I2SCFGR_DATLEN_24	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_I2SCFGR_DATLEN, 1)	///< 24-bit data
#define MCCI_STM32L0_SPI_I2SCFGR_DATLEN_32	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_I2SCFGR_DATLEN, 2)	///< 32-bit data
#define MCCI_STM32L0_SPI_I2SCFGR_DATLEN_XX	MCCI_BOOTLOADER_FIELD_SET_VALUE(MCCI_STM32L0_SPI_I2SCFGR_DATLEN, 3)	///< invalid data length
#define MCCI_STM32L0_SPI_I2SCFGR_CHLEN		(UINT32_C(1) << 0)	///< channel 32-bits wide (not 16)
///	@}

/****************************************************************************\
|
|	I2C Control Registers (Section 27.7)
|
\****************************************************************************/

/// \name I2C register offsets
///	@{
#define	MCCI_STM32L0_I2C_CR1		UINT32_C(0x00)	///< Section 27.7.1: control register 1
#define	MCCI_STM32L0_I2C_CR2		UINT32_C(0x04)	///< Section 27.7.2: control register 2
#define	MCCI_STM32L0_I2C_OAR1		UINT32_C(0x08)	///< Section 27.7.3: own address register 1
#define	MCCI_STM32L0_I2C_OAR2		UINT32_C(0x0C)	///< Section 27.7.4: own address register 2
#define	MCCI_STM32L0_I2C_TIMINGR	UINT32_C(0x10)	///< Section 27.7.5: timing register
#define	MCCI_STM32L0_I2C_TIMEOUTR	UINT32_C(0x14)	///< Section 27.7.6: timeout register
#define	MCCI_STM32L0_I2C_ISR		UINT32_C(0x18)	///< Section 27.7.7: interrupt and status register
#define	MCCI_STM32L0_I2C_ICR		UINT32_C(0x1C)	///< Section 27.7.8: interrupt clear register
#define	MCCI_STM32L0_I2C_PECR		UINT32_C(0x20)	///< Section 27.7.9: PEC register
#define	MCCI_STM32L0_I2C_RXDR		UINT32_C(0x24)	///< Section 27.7.10: receive data register
#define	MCCI_STM32L0_I2C_TXDR		UINT32_C(0x28)	///< Section 27.7.11: transmit data register
///	@}

/// \name I2C_CR1 bits
///	@{
#define MCCI_STM32L0_I2C_CR1_RSV24	UINT32_C(0xFF000000)	///< reserved: do not change
#define	MCCI_STM32L0_I2C_CR1_PECEN	(UINT32_C(1) << 23)	///< PEC calculation enable
#define	MCCI_STM32L0_I2C_CR1_ALERTEN	(UINT32_C(1) << 22)	///< SMBus alert enable
#define	MCCI_STM32L0_I2C_CR1_SMBDEN	(UINT32_C(1) << 21)	///< SMBus device default address enable
#define	MCCI_STM32L0_I2C_CR1_SMBHEN	(UINT32_C(1) << 20)	///< SMBus host address enable
#define	MCCI_STM32L0_I2C_CR1_GCEN	(UINT32_C(1) << 19)	///< general call enable
#define	MCCI_STM32L0_I2C_CR1_WUPEN	(UINT32_C(1) << 18)	///< wakeup from Stop mode enable
#define	MCCI_STM32L0_I2C_CR1_NOSTRETCH	(UINT32_C(1) << 17)	///< clock stretching disable
#define	MCCI_STM32L0_I2C_CR1_SBC	(UINT32_C(1) << 16)	///< slave byte control
#define	MCCI_STM32L0_I2C_CR1_RXDMAEN	(UINT32_C(1) << 15)	///< DMA reception requests enable
#define	MCCI_STM32L0_I2C_CR1_TXDMAEN	(UINT32_C(1) << 14)	///< DMA transmission requests enable
#define	MCCI_STM32L0_I2C_CR1_RSV13	(UINT32_C(1) << 13)	///< reserved: do not change
#define	MCCI_STM32L0_I2C_CR1_ANFOFF	(UINT32_C(1) << 12)	///< analog noise filter OFF
#define	MCCI_STM32L0_I2C_CR1_DNF	(UINT32_C(0xF) << 8)	///< digital noise filter [3:0]
#define	MCCI_STM32L0_I2C_CR1_ERRIE	(UINT32_C(1) << 7)	///< error interrupts enable
#define	MCCI_STM32L0_I2C_CR1_TCIE	(UINT32_C(1) << 6)	///< transfer complete interrupt enable
#define	MCCI_STM32L0_I2C_CR1_STOPIE	(UINT32_C(1) << 5)	///< STOP detection interrupt enable
#define	MCCI_STM32L0_I2C_CR1_NACKIE	(UINT32_C(1) << 4)	///< NACK received interrupt enable
#define	MCCI_STM32L0_I2C_CR1_ADDRIE	(UINT32_C(1) << 3)	///< address match interrupt enable (slave)
#define	MCCI_STM32L0_I2C_CR1_RXIE	(UINT32_C(1) << 2)	///< RX interrupt enable
#define	MCCI_STM32L0_I2C_CR1_TXIE	(UINT32_C(1) << 1)	///< TX interrupt enable
#define	MCCI_STM32L0_I2C_CR1_PE		(UINT32_C(1) << 0)	///< peripheral enable
///	@}

