mcci-catena/bootloader/platform/soc/stm32l0/i/mcci_stm32l0xx.h
/// \name I2C_CR2 bits
///	@{
#define	MCCI_STM32L0_I2C_CR2_RSV27	UINT32_C(0xf8000000)	///< reserved: do not change
#define	MCCI_STM32L0_I2C_CR2_PECBYTE	(UINT32_C(1) << 26)	///< packet error checking byte
#define	MCCI_STM32L0_I2C_CR2_AUTOEND	(UINT32_C(1) << 25)	///< automatic end mode (master)
#define	MCCI_STM32L0_I2C_CR2_RELOAD	(UINT32_C(1) << 24)	///< NBYTES reload mode
#define	MCCI_STM32L0_I2C_CR2_NBYTES	(UINT32_C(0xFF) << 16)	///< number of bytes [7:0]
#define	MCCI_STM32L0_I2C_CR2_NACK	(UINT32_C(1) << 15)	///< NACK generation (slave)
#define	MCCI_STM32L0_I2C_CR2_STOP	(UINT32_C(1) << 14)	///< STOP generation (master)
#define	MCCI_STM32L0_I2C_CR2_START	(UINT32_C(1) << 13)	///< START generation
#define	MCCI_STM32L0_I2C_CR2_HEAD10R	(UINT32_C(1) << 12)	///< 10-bit address header only read direction
#define	MCCI_STM32L0_I2C_CR2_ADD10	(UINT32_C(1) << 11)	///< 10-bit addressing mode (master)
#define	MCCI_STM32L0_I2C_CR2_RD_WRN	(UINT32_C(1) << 10)	///< transfer direction: 1=read, 0=write
#define	MCCI_STM32L0_I2C_CR2_SADD	(UINT32_C(0x3FF) << 0)	///< slave address [9:0]
///	@}

/// \name I2C_OAR1 bits
///	@{
#define	MCCI_STM32L0_I2C_OAR1_RSV16	UINT32_C(0xFFFF0000)	///< reserved: do not change
#define	MCCI_STM32L0_I2C_OAR1_OA1EN	(UINT32_C(1) << 15)	///< own address 1 enable
#define	MCCI_STM32L0_I2C_OAR1_RSV11	(UINT32_C(0xF) << 11)	///< reserved: do not change
#define	MCCI_STM32L0_I2C_OAR1_OA1MODE	(UINT32_C(1) << 10)	///< own address 1 10-bit mode
#define	MCCI_STM32L0_I2C_OAR1_OA1	(UINT32_C(0x3FF) << 0)	///< own address 1 [9:0]
///	@}

/// \name I2C_OAR2 bits
///	@{
#define	MCCI_STM32L0_I2C_OAR2_RSV16	UINT32_C(0xFFFF0000)	///< reserved: do not change
#define	MCCI_STM32L0_I2C_OAR2_OA2EN	(UINT32_C(1) << 15)	///< own address 2 enable
#define	MCCI_STM32L0_I2C_OAR2_RSV11	(UINT32_C(0xF) << 11)	///< reserved: do not change
#define	MCCI_STM32L0_I2C_OAR2_OA2MSK	(UINT32_C(0x7) << 8)	///< own address 2 masks [2:0]
#define	MCCI_STM32L0_I2C_OAR2_OA2	(UINT32_C(0x7F) << 1)	///< own address 2 [7:1]
#define	MCCI_STM32L0_I2C_OAR2_RSV0	(UINT32_C(1) << 0)	///< reserved: do not change
///	@}

/// \name I2C_TIMINGR bits
///	@{
#define	MCCI_STM32L0_I2C_TIMINGR_PRESC	(UINT32_C(0xF) << 28)	///< timing prescaler [3:0]
#define	MCCI_STM32L0_I2C_TIMINGR_RSV24	(UINT32_C(0xF) << 24)	///< reserved: do not change
#define	MCCI_STM32L0_I2C_TIMINGR_SCLDEL	(UINT32_C(0xF) << 20)	///< data setup time [3:0]
#define	MCCI_STM32L0_I2C_TIMINGR_SDADEL	(UINT32_C(0xF) << 16)	///< data hold time [3:0]
#define	MCCI_STM32L0_I2C_TIMINGR_SCLH	(UINT32_C(0xFF) << 8)	///< SCL high period [7:0] (master)
#define	MCCI_STM32L0_I2C_TIMINGR_SCLL	(UINT32_C(0xFF) << 0)	///< SCL low period [7:0] (master)
///	@}

/// \name I2C_TIMEOUTR bits
///	@{
#define	MCCI_STM32L0_I2C_TIMEOUTR_TEXTEN	(UINT32_C(1) << 31)	///< extended clock timeout enable
#define	MCCI_STM32L0_I2C_TIMEOUTR_RSV28		(UINT32_C(0x7) << 28)	///< reserved: do not change
#define	MCCI_STM32L0_I2C_TIMEOUTR_TIMEOUTB	(UINT32_C(0xFFF) << 16)	///< bus timeout B [11:0]
#define	MCCI_STM32L0_I2C_TIMEOUTR_TIMOUTEN	(UINT32_C(1) << 15)	///< clock timeout enable
#define	MCCI_STM32L0_I2C_TIMEOUTR_RSV13		(UINT32_C(0x3) << 13)	///< reserved: do not change
#define	MCCI_STM32L0_I2C_TIMEOUTR_TIDLE		(UINT32_C(1) << 12)	///< idle clock timeout detection
#define	MCCI_STM32L0_I2C_TIMEOUTR_TIMEOUTA	(UINT32_C(0xFFF) << 0)	///< bus timeout A [11:0]
///	@}

/// \name I2C_ISR bits
///	@{
#define	MCCI_STM32L0_I2C_ISR_RSV24	UINT32_C(0xFF000000)	///< reserved: do not change
#define	MCCI_STM32L0_I2C_ISR_ADDCODE	(UINT32_C(0x7F) << 17)	///< address match code (slave) [6:0]
#define	MCCI_STM32L0_I2C_ISR_DIR	(UINT32_C(1) << 16)	///< transfer direction (slave): 1=read, 0=write
#define	MCCI_STM32L0_I2C_ISR_BUSY	(UINT32_C(1) << 15)	///< bus busy
#define	MCCI_STM32L0_I2C_ISR_RSV14	(UINT32_C(1) << 14)	///< reserved: do not change
#define	MCCI_STM32L0_I2C_ISR_ALERT	(UINT32_C(1) << 13)	///< SMBus alert
#define	MCCI_STM32L0_I2C_ISR_TIMEOUT	(UINT32_C(1) << 12)	///< timeout or tLOW detection flag
#define	MCCI_STM32L0_I2C_ISR_PECERR	(UINT32_C(1) << 11)	///< PEC error in reception
#define	MCCI_STM32L0_I2C_ISR_OVR	(UINT32_C(1) << 10)	///< overrun/underrun (slave)
#define	MCCI_STM32L0_I2C_ISR_ARLO	(UINT32_C(1) << 9)	///< arbitration lost
#define	MCCI_STM32L0_I2C_ISR_BERR	(UINT32_C(1) << 8)	///< bus error
#define	MCCI_STM32L0_I2C_ISR_TCR	(UINT32_C(1) << 7)	///< transfer complete reload
#define	MCCI_STM32L0_I2C_ISR_TC		(UINT32_C(1) << 6)	///< transfer complete (master)
#define	MCCI_STM32L0_I2C_ISR_STOPF	(UINT32_C(1) << 5)	///< STOP detection flag
#define	MCCI_STM32L0_I2C_ISR_NACKF	(UINT32_C(1) << 4)	///< not acknowledge received flag
#define	MCCI_STM32L0_I2C_ISR_ADDR	(UINT32_C(1) << 3)	///< address matched (slave)
#define	MCCI_STM32L0_I2C_ISR_RXNE	(UINT32_C(1) << 2)	///< receive data register not empty
#define	MCCI_STM32L0_I2C_ISR_TXIS	(UINT32_C(1) << 1)	///< transmit interrupt status
#define	MCCI_STM32L0_I2C_ISR_TXE	(UINT32_C(1) << 0)	///< transmit data register empty
///	@}

/// \name I2C_ICR bits
///	@{
#define	MCCI_STM32L0_I2C_ICR_RSV14	UINT32_C(0xFFFFC000)	///< reserved: do not change
#define	MCCI_STM32L0_I2C_ICR_ALERTCF	(UINT32_C(1) << 13)	///< alert flag clear
#define	MCCI_STM32L0_I2C_ICR_TIMOUTCF	(UINT32_C(1) << 12)	///< timeout detection flag clear
#define	MCCI_STM32L0_I2C_ICR_PECCF	(UINT32_C(1) << 11)	///< PEC error flag clear
#define	MCCI_STM32L0_I2C_ICR_OVRCF	(UINT32_C(1) << 10)	///< overrun/underrun flag clear
#define	MCCI_STM32L0_I2C_ICR_ARLOCF	(UINT32_C(1) << 9)	///< arbitration lost flag clear
#define	MCCI_STM32L0_I2C_ICR_BERRCF	(UINT32_C(1) << 8)	///< bus error flag clear
#define	MCCI_STM32L0_I2C_ICR_RSV6	(UINT32_C(0x3) << 6)	///< reserved: do not change
#define	MCCI_STM32L0_I2C_ICR_STOPCF	(UINT32_C(1) << 5)	///< STOP detection flag clear
#define	MCCI_STM32L0_I2C_ICR_NACKCF	(UINT32_C(1) << 4)	///< not acknowledge flag clear
#define	MCCI_STM32L0_I2C_ICR_ADDRCF	(UINT32_C(1) << 3)	///< address matched flag clear
#define	MCCI_STM32L0_I2C_ICR_RSV0	(UINT32_C(0x7) << 0)	///< reserved: do not change
///	@}


#ifdef __cplusplus
}
#endif

#endif /* _mcci_stm32l0xx_h_ */
